# Working with CSV files

In [ ]:
#!pip install pandas

In [ ]:
#!conda install pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import read_csv

In [3]:
df=pd.read_csv("My Uber Drives - 2016.csv")

In [ ]:
df

In [ ]:
type(df)

In [6]:
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [ ]:
df.head()

In [ ]:
df.head(10)

In [ ]:
df.shape

In [ ]:
df.tail()

In [ ]:
df.info()

# Common Data Manipulation Tasks
## 1. Selecting/indexing
## 2. Filtering
## 3. Sorting
## 4. Mutating/conditionally adding columns
## 5. Group by/Summarize

In [14]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [ ]:
df.iloc[0:5,0:4]

In [ ]:
df.iloc[0:5,[0,1]]

In [ ]:
df.iloc[0:4]

In [ ]:
df.iloc[:,0:4]

In [ ]:
df.iloc[0:4,]

In [ ]:
df.iloc[:,:-1]

In [ ]:
df.shape

In [ ]:
df.iloc[:,: -1]

In [ ]:
df.loc[:,'START*']

In [ ]:
df.loc[0:5,['START*','STOP*']]

In [5]:
df.shape

(1156, 7)

# Filtering

In [8]:
df[df['MILES*']>10]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
9,01-10-2016 12:17,01-10-2016 12:44,Business,Jamaica,New York,16.5,Customer Visit
10,01-10-2016 15:08,01-10-2016 15:51,Business,New York,Queens,10.8,Meeting
22,01-12-2016 16:02,01-12-2016 17:00,Business,New York,Queens County,15.1,Meeting
23,1/13/2016 13:54,1/13/2016 14:07,Business,Downtown,Gulfton,11.2,Meeting
...,...,...,...,...,...,...,...
1134,12/29/2016 11:28,12/29/2016 12:00,Business,Unknown Location,Kar?chi,11.9,Meal/Entertain
1144,12/29/2016 23:14,12/29/2016 23:47,Business,Unknown Location,Kar?chi,12.9,Meeting
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [12]:
df2 = df.loc[df['MILES*']>10,['START*','MILES*']]
print(df2)

                START*   MILES*
4          Fort Pierce     63.7
9              Jamaica     16.5
10            New York     10.8
22            New York     15.1
23            Downtown     11.2
...                ...      ...
1134  Unknown Location     11.9
1144  Unknown Location     12.9
1152  Unknown Location     16.2
1154           Gampaha     48.2
1155               NaN  12204.7

[316 rows x 2 columns]

In [15]:
df.loc[df['MILES*']>10].head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
9,01-10-2016 12:17,01-10-2016 12:44,Business,Jamaica,New York,16.5,Customer Visit
10,01-10-2016 15:08,01-10-2016 15:51,Business,New York,Queens,10.8,Meeting
22,01-12-2016 16:02,01-12-2016 17:00,Business,New York,Queens County,15.1,Meeting
23,1/13/2016 13:54,1/13/2016 14:07,Business,Downtown,Gulfton,11.2,Meeting

In [21]:
df.loc[df['START*']=='New York',['MILES*']].head()

     MILES*
10     10.8
22     15.1
106    13.0
423    16.3

In [25]:
df[df['START*'].isin(["New York","Queens"])]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
10,01-10-2016 15:08,01-10-2016 15:51,Business,New York,Queens,10.8,Meeting
22,01-12-2016 16:02,01-12-2016 17:00,Business,New York,Queens County,15.1,Meeting
106,2/14/2016 16:35,2/14/2016 17:02,Business,New York,Long Island City,13.0,Meeting
423,06-10-2016 15:19,06-10-2016 16:28,Business,New York,Jamaica,16.3,Meeting

In [33]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN

In [36]:
df.sort_values(by=['START*','MILES*'],ascending=True).head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
908,11-05-2016 08:34,11-05-2016 08:43,Business,Agnew,Renaissance,2.2,NaN
910,11-05-2016 19:20,11-05-2016 19:28,Business,Agnew,Agnew,2.2,NaN
911,11-06-2016 10:50,11-06-2016 11:04,Business,Agnew,Renaissance,2.4,NaN
906,11-04-2016 21:04,11-04-2016 21:20,Business,Agnew,Cory,4.3,NaN
879,10/30/2016 12:58,10/30/2016 13:18,Business,Almond,Bryson City,15.2,NaN

# Conditionally Adding Columns

In [40]:
df['MILES_CAT']=np.where(df["MILES*"]>5,'Longtrip','Shorttrip')

In [42]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,MILES_CAT
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Longtrip
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Shorttrip
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Shorttrip
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Shorttrip
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Longtrip